#### Terraform Plan 📋
<details><summary>Show Plan</summary>

```terraform
data.aws_ami.ubuntu: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=615299732970]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0030e4319cbf4dbf2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.vpc_flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/monitoring-production"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "monitoring-vpc-flow-logs-production"
        }
      + tags_all          = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-vpc-flow-logs-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
    }

  # aws_cloudwatch_metric_alarm.monitoring_cpu[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "monitoring_cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "Monitoring server CPU utilization is too high"
      + alarm_name                            = "monitoring-server-high-cpu-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "monitoring-cpu-alarm-production"
        }
      + tags_all                              = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-cpu-alarm-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.monitoring_disk[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "monitoring_disk" {
      + actions_enabled                       = true
      + alarm_description                     = "Monitoring server disk space is low"
      + alarm_name                            = "monitoring-server-low-disk-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DiskSpaceUtilization"
      + namespace                             = "CWAgent"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "monitoring-disk-alarm-production"
        }
      + tags_all                              = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-disk-alarm-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + threshold                             = 20
      + treat_missing_data                    = "missing"
    }

  # aws_eip.monitoring will be created
  + resource "aws_eip" "monitoring" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "monitoring-eip-production"
        }
      + tags_all             = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-eip-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + vpc                  = (known after apply)
    }

  # aws_flow_log.monitoring[0] will be created
  + resource "aws_flow_log" "monitoring" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "monitoring-vpc-flow-logs-production"
        }
      + tags_all                 = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-vpc-flow-logs-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_instance_profile.monitoring will be created
  + resource "aws_iam_instance_profile" "monitoring" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "monitoring-server-profile-production"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "monitoring-server-role-production"
      + tags        = {
          + "Name" = "monitoring-server-profile-production"
        }
      + tags_all    = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-server-profile-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.monitoring will be created
  + resource "aws_iam_role" "monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "monitoring-server-role-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "monitoring-server-role-production"
        }
      + tags_all              = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-server-role-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.vpc_flow_logs[0] will be created
  + resource "aws_iam_role" "vpc_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "monitoring-vpc-flow-logs-role-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "monitoring-vpc-flow-logs-role-production"
        }
      + tags_all              = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-vpc-flow-logs-role-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.monitoring will be created
  + resource "aws_iam_role_policy" "monitoring" {
      + id          = (known after apply)
      + name        = "monitoring-server-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.vpc_flow_logs[0] will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id          = (known after apply)
      + name        = "monitoring-vpc-flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_instance.monitoring will be created
  + resource "aws_instance" "monitoring" {
      + ami                                  = "ami-0030e4319cbf4dbf2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "monitoring-server-profile-production"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "monitoring-key-production"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "monitoring-server-production"
          + "Type" = "Monitoring"
        }
      + tags_all                             = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-server-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
          + "Type"        = "Monitoring"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "87fe44e4f3f118b3334380d7ca53e4ef4b212994"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = false
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "monitoring-root-volume-production"
            }
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.monitoring will be created
  + resource "aws_internet_gateway" "monitoring" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "monitoring-igw-production"
        }
      + tags_all = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-igw-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.monitoring will be created
  + resource "aws_key_pair" "monitoring" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "monitoring-key-production"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "Name" = "monitoring-key-production"
        }
      + tags_all        = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-key-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "monitoring-public-rt-production"
        }
      + tags_all         = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-public-rt-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.monitoring_backups will be created
  + resource "aws_s3_bucket" "monitoring_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "monitoring-backups-production-615299732970"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "monitoring-backups-production"
          + "Purpose"     = "Prometheus and Grafana data backups"
        }
      + tags_all                    = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-backups-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
          + "Purpose"     = "Prometheus and Grafana data backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.monitoring_backups will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "monitoring_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "delete-old-backups"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
      + rule {
          + id     = "delete-old-versions"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # aws_s3_bucket_public_access_block.monitoring_backups will be created
  + resource "aws_s3_bucket_public_access_block" "monitoring_backups" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.monitoring_backups will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "monitoring_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.monitoring_backups will be created
  + resource "aws_s3_bucket_versioning" "monitoring_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.monitoring will be created
  + resource "aws_security_group" "monitoring" {
      + arn                    = (known after apply)
      + description            = "Security group for Prometheus and Grafana monitoring server"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "monitoring-server-sg-production"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "monitoring-server-sg-production"
        }
      + tags_all               = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-server-sg-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.monitoring_alertmanager will be created
  + resource "aws_security_group_rule" "monitoring_alertmanager" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "AlertManager web interface"
      + from_port                = 9093
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9093
      + type                     = "ingress"
    }

  # aws_security_group_rule.monitoring_blackbox will be created
  + resource "aws_security_group_rule" "monitoring_blackbox" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Blackbox Exporter"
      + from_port                = 9115
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9115
      + type                     = "ingress"
    }

  # aws_security_group_rule.monitoring_egress will be created
  + resource "aws_security_group_rule" "monitoring_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.monitoring_grafana will be created
  + resource "aws_security_group_rule" "monitoring_grafana" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Grafana web interface"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # aws_security_group_rule.monitoring_node_exporter will be created
  + resource "aws_security_group_rule" "monitoring_node_exporter" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Node Exporter metrics"
      + from_port                = 9100
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9100
      + type                     = "ingress"
    }

  # aws_security_group_rule.monitoring_prometheus will be created
  + resource "aws_security_group_rule" "monitoring_prometheus" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Prometheus web interface"
      + from_port                = 9090
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9090
      + type                     = "ingress"
    }

  # aws_security_group_rule.monitoring_ssh will be created
  + resource "aws_security_group_rule" "monitoring_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "SSH access"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_ssm_parameter.monitoring_private_key will be created
  + resource "aws_ssm_parameter" "monitoring_private_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SSH private key for monitoring server"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/monitoring/production/ssh-private-key"
      + tags           = {
          + "Name" = "monitoring-ssh-key-production"
        }
      + tags_all       = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-ssh-key-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "monitoring-public-subnet-1-production"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-public-subnet-1-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
          + "Tier"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "monitoring-public-subnet-2-production"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-public-subnet-2-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
          + "Tier"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.monitoring will be created
  + resource "aws_vpc" "monitoring" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "monitoring-vpc-production"
        }
      + tags_all                             = {
          + "CostCenter"  = "DevOps"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monitoring-vpc-production"
          + "Owner"       = "DevOps Team"
          + "Project"     = "Monitoring Infrastructure"
        }
    }

  # tls_private_key.monitoring will be created
  + resource "tls_private_key" "monitoring" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alertmanager_url              = (known after apply)
  + ansible_inventory             = (known after apply)
  + backup_bucket_name            = (known after apply)
  + grafana_url                   = (known after apply)
  + monitoring_server_id          = (known after apply)
  + monitoring_server_private_ip  = (known after apply)
  + monitoring_server_public_ip   = (known after apply)
  + prometheus_url                = (known after apply)
  + security_group_id             = (known after apply)
  + ssh_command                   = (known after apply)
  + ssh_private_key_ssm_parameter = (sensitive value)
  + subnet_ids                    = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Branch**: `dev`
**Workflow**: `Deploy Monitoring Infrastructure`

*Pusher: @shehuj*